// רואיה חבשה - רואן חבשה

function isPrime(num) 
{//פונקציה בודקת אם המספר ראשוני אם כן מחזירה אמת אחרת מחזירה שקר ו
  if (num <= 1)
     return false; // מספרים קטנים מ-2 אינם ראשוניים
  for (let i = 2; i <= Math.sqrt(num); i++) 
    { // נבדוק עד השורש הריבועי של המספר
      if (num % i === 0) 
          return false; //   המספר לא ראשוני
  }
  return true; //  המספר ראשוני
}

// הדפסת כל המספרים הראשוניים פחות מ-237
for (let i = 2; i < 237; i++) 
{
  if (isPrime(i)) 
      console.log(i); // מדפיס את המספר אם הוא ראשוני
    
}